DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
// SPDX-License-Identifier: BSD-3-Clause
/*
 * Copyright (c) 2021-2022, STMicroelectronics
 */

#include <assert.h>
#include <config.h>
#include <crypto/crypto.h>
#include <drivers/clk.h>
#include <drivers/clk_dt.h>
#include <drivers/stm32_exti.h>
#include <drivers/stm32_gpio.h>
#include <drivers/stm32_rtc.h>
#include <drivers/stm32_tamp.h>
#if defined(CFG_STM32MP15)
#include <drivers/stm32mp1_rcc.h>
#endif
#if defined(CFG_STM32MP13)
#include <drivers/stm32mp13_rcc.h>
#endif
#if defined(CFG_STM32MP25)
#include <drivers/stm32mp25_rcc.h>
#endif
#include <io.h>
#include <kernel/boot.h>
#include <kernel/delay.h>
#include <kernel/dt.h>
#include <kernel/interrupt.h>
#include <libfdt.h>
#include <mm/core_memprot.h>
#include <stdbool.h>
#ifdef CFG_STM32MP25
#include <stm32_sysconf.h>
#endif /* CFG_STM32MP25 */
#include <stm32_util.h>


/* STM32 Registers */
#define _TAMP_CR1			U(0x00)
#define _TAMP_CR2			U(0x04)
#define _TAMP_CR3			U(0x08)
#define _TAMP_FLTCR			U(0x0C)
#define _TAMP_ATCR1			U(0x10)
#define _TAMP_ATSEEDR			U(0x14)
#define _TAMP_ATOR			U(0x18)
#define _TAMP_ATCR2			U(0x1C)
#define _TAMP_SECCFGR			U(0x20)
#define _TAMP_SMCR			U(0x20)
#define _TAMP_PRIVCFGR			U(0x24)
#define _TAMP_IER			U(0x2C)
#define _TAMP_SR			U(0x30)
#define _TAMP_MISR			U(0x34)
#define _TAMP_SMISR			U(0x38)
#define _TAMP_SCR			U(0x3C)
#define _TAMP_COUNTR			U(0x40)
#define _TAMP_COUNT2R			U(0x44)
#define _TAMP_OR			U(0x50)
#define _TAMP_ERCFGR			U(0X54)
#define _TAMP_BKPRIFR(x)		(U(0x70) + U(0x4) * ((x) - 1))
#define _TAMP_CIDCFGR(x)		(U(0x80) + U(0x4) * (x))
#define _TAMP_BKPxR(x)			(U(0x100) + U(0x4) * ((x) - 1))
#define _TAMP_HWCFGR2			U(0x3EC)
#define _TAMP_HWCFGR1			U(0x3F0)
#define _TAMP_VERR			U(0x3F4)
#define _TAMP_IPIDR			U(0x3F8)
#define _TAMP_SIDR			U(0x3FC)

/* _TAMP_CR1 bit fields */
#define _TAMP_CR1_ITAMP(id)		BIT((id) - INT_TAMP1 + U(16))
#define _TAMP_CR1_ETAMP(id)		BIT((id) - EXT_TAMP1)

/* _TAMP_CR2 bit fields */
#define _TAMP_CR2_ETAMPTRG(id)		BIT((id) - EXT_TAMP1 + U(24))
#define _TAMP_CR2_BKERASE		BIT(23)
#define _TAMP_CR2_BKBLOCK		BIT(22)
#define _TAMP_CR2_ETAMPMSK_MAX_ID	U(3)
#define _TAMP_CR2_ETAMPMSK(id)		BIT((id) - EXT_TAMP1 + U(16))
#define _TAMP_CR2_ETAMPNOER(id)		BIT((id) - EXT_TAMP1)

/* _TAMP_CR3 bit fields */
#define _TAMP_CR3_ITAMPNOER_ALL		GENMASK_32(12, 0)
#define _TAMP_CR3_ITAMPNOER(id)		BIT((id) - INT_TAMP1)

/* _TAMP_FLTCR bit fields */
#define _TAMP_FLTCR_TAMPFREQ_MASK	GENMASK_32(2, 0)
#define _TAMP_FLTCR_TAMPFREQ_SHIFT	U(0)
#define _TAMP_FLTCR_TAMPFLT_MASK	GENMASK_32(4, 3)
#define _TAMP_FLTCR_TAMPFLT_SHIFT	U(3)
#define _TAMP_FLTCR_TAMPPRCH_MASK	GENMASK_32(6, 5)
#define _TAMP_FLTCR_TAMPPRCH_SHIFT	U(5)
#define _TAMP_FLTCR_TAMPPUDIS		BIT(7)

/* _TAMP_ATCR bit fields */
#define _TAMP_ATCR1_ATCKSEL_MASK	GENMASK_32(19, 16)
#define _TAMP_ATCR1_ATCKSEL_SHIFT	U(16)
#define _TAMP_ATCR1_ATPER_MASK		GENMASK_32(26, 24)
#define _TAMP_ATCR1_ATPER_SHIFT		U(24)
#define _TAMP_ATCR1_ATOSHARE		BIT(30)
#define _TAMP_ATCR1_FLTEN		BIT(31)
#define _TAMP_ATCR1_COMMON_MASK		GENMASK_32(31, 16)
#define _TAMP_ATCR1_ETAMPAM(id)		BIT((id) - EXT_TAMP1)
#define _TAMP_ATCR1_ATOSEL_MASK(id)	GENMASK_32(((id) - EXT_TAMP1 + 1) *    \
						   U(2) + U(7),                \
						   ((id) - EXT_TAMP1) *        \
						   U(2) + U(8))
#define _TAMP_ATCR1_ATOSEL(id, od)	SHIFT_U32(((od) - OUT_TAMP1),          \
					 (((id) - EXT_TAMP1) * U(2) + U(8)))

/* _TAMP_ATOR bit fields */
#define _TAMP_PRNG			GENMASK_32(7, 0)
#define _TAMP_SEEDF			BIT(14)
#define _TAMP_INITS			BIT(15)

/* _TAMP_IER bit fields */
#define _TAMP_IER_ITAMP(id)		BIT((id) - INT_TAMP1 + U(16))
#define _TAMP_IER_ETAMP(id)		BIT((id) - EXT_TAMP1)

/* _TAMP_SR bit fields */
#define _TAMP_SR_ETAMPXF_MASK		GENMASK_32(7, 0)
#define _TAMP_SR_ITAMPXF_MASK		GENMASK_32(31, 16)
#define _TAMP_SR_ITAMP(id)		BIT((id) - INT_TAMP1 + U(16))
#define _TAMP_SR_ETAMP(id)		BIT((id) - EXT_TAMP1)

/* _TAMP_SCR bit fields */
#define _TAMP_SCR_ITAMP(id)		BIT((id) - INT_TAMP1 + U(16))
#define _TAMP_SCR_ETAMP(id)		BIT((id) - EXT_TAMP1)

/* _TAMP_SECCFGR bit fields */
#define _TAMP_SECCFGR_BKPRWSEC_MASK	GENMASK_32(7, 0)
#define _TAMP_SECCFGR_BKPRWSEC_SHIFT	U(0)
#define _TAMP_SECCFGR_CNT2SEC		BIT(14)
#define _TAMP_SECCFGR_CNT2SEC_SHIFT	U(14)
#define _TAMP_SECCFGR_CNT1SEC		BIT(15)
#define _TAMP_SECCFGR_CNT1SEC_SHIFT	U(15)
#define _TAMP_SECCFGR_BKPWSEC_MASK	GENMASK_32(23, 16)
#define _TAMP_SECCFGR_BKPWSEC_SHIFT	U(16)
#define _TAMP_SECCFGR_BHKLOCK		BIT(30)
#define _TAMP_SECCFGR_TAMPSEC		BIT(31)
#define _TAMP_SECCFGR_TAMPSEC_SHIFT	U(31)
#define _TAMP_SECCFGR_BUT_BKP_MASK	(GENMASK_32(31, 30) | \
					 GENMASK_32(15, 14))
#define _TAMP_SECCFGR_RIF_TAMP_SEC	BIT(0)
#define _TAMP_SECCFGR_RIF_COUNT_1	BIT(1)
#define _TAMP_SECCFGR_RIF_COUNT_2	BIT(2)

/* _TAMP_SMCR bit fields */
#define _TAMP_SMCR_BKPRWDPROT_MASK	GENMASK_32(7, 0)
#define _TAMP_SMCR_BKPRWDPROT_SHIFT	U(0)
#define _TAMP_SMCR_BKPWDPROT_MASK	GENMASK_32(23, 16)
#define _TAMP_SMCR_BKPWDPROT_SHIFT	U(16)
#define _TAMP_SMCR_DPROT		BIT(31)

/*
 * _TAMP_PRIVCFGR bit fields
 */
#define _TAMP_PRIVCFG_CNT2PRIV		BIT(14)
#define _TAMP_PRIVCFG_CNT1PRIV		BIT(15)
#define _TAMP_PRIVCFG_BKPRWPRIV		BIT(29)
#define _TAMP_PRIVCFG_BKPWPRIV		BIT(30)
#define _TAMP_PRIVCFG_TAMPPRIV		BIT(31)
#define _TAMP_PRIVCFGR_MASK		(GENMASK_32(31, 29) | \
					 GENMASK_32(15, 14))
#define _TAMP_PRIVCFGR_RIF_TAMP_PRIV	BIT(0)
#define _TAMP_PRIVCFGR_RIF_R1		BIT(1)
#define _TAMP_PRIVCFGR_RIF_R2		BIT(2)

/* _TAMP_ATCR2 bit fields */
#define _TAMP_ATCR2_ATOSEL_MASK(id)	GENMASK_32(((id) - EXT_TAMP1 + 1) *    \
						   U(3) + U(7),                \
						   ((id) - EXT_TAMP1) *        \
						   U(3) + U(8))
#define _TAMP_ATCR2_ATOSEL(id, od)	SHIFT_U32(((od) - OUT_TAMP1),          \
						 (((id) - EXT_TAMP1) *         \
						  U(3) + U(8)))

/* _TAMP_OR bit fields */
#define _TAMP_STM32MP13_OR_IN1RMP_PF10		U(0)
#define _TAMP_STM32MP13_OR_IN1RMP_PC13		BIT(0)
#define _TAMP_STM32MP13_OR_IN2RMP_PA6		U(0)
#define _TAMP_STM32MP13_OR_IN2RMP_PI1		BIT(1)
#define _TAMP_STM32MP13_OR_IN3RMP_PC0		U(0)
#define _TAMP_STM32MP13_OR_IN3RMP_PI2		BIT(2)
#define _TAMP_STM32MP13_OR_IN4RMP_PG8		U(0)
#define _TAMP_STM32MP13_OR_IN4RMP_PI3		BIT(3)

/* For STM32MP15x, _TAMP_CFGR is _TAMP_OR */
#define _TAMP_STM32MP15_OR_OUT3RMP_PI8		U(0)
#define _TAMP_STM32MP15_OR_OUT3RMP_PC13		BIT(0)

#define _TAMP_STM32MP25_OR_IN1RMP_PC4		U(0)
#define _TAMP_STM32MP25_OR_IN1RMP_PI8		BIT(0)
#define _TAMP_STM32MP25_OR_IN3RMP_PC3		U(0)
#define _TAMP_STM32MP25_OR_IN3RMP_PZ2		BIT(1)
#define _TAMP_STM32MP25_OR_IN5RMP_PF6		U(0)
#define _TAMP_STM32MP25_OR_IN5RMP_PZ4		BIT(2)

/* _TAMP_ERCFGR bit fields */
#define _TAMP_ERCFGR_ERCFG0		BIT(0)
#define _TAMP_ERCFGR_ERCFG_MASK		BIT(0)

/* _TAMP_HWCFGR2 bit fields */
#define _TAMP_HWCFGR2_OR		GENMASK_32(7, 0)
#define _TAMP_HWCFGR2_TZ		GENMASK_32(11, 8)
#define _TAMP_HWCFGR2_RIF		GENMASK_32(19, 16)
#define _TAMP_HWCFGR2_CID_WIDTH		GENMASK_32(23, 20)
#define _TAMP_HWCFGR2_NDEV_SECRETS	GENMASK_32(31, 24)

/* _TAMP_HWCFGR1 bit fields */
#define _TAMP_HWCFGR1_BKPREG		GENMASK_32(7, 0)
#define _TAMP_HWCFGR1_TAMPER_SHIFT	U(8)
#define _TAMP_HWCFGR1_TAMPER		GENMASK_32(11, 8)
#define _TAMP_HWCFGR1_ACTIVE		GENMASK_32(15, 12)
#define _TAMP_HWCFGR1_INTERN		GENMASK_32(31, 16)
#define _TAMP_HWCFGR1_ITAMP_MAX_ID	U(16)
#define _TAMP_HWCFGR1_ITAMP(id)		BIT((id) - INT_TAMP1 + U(16))

