DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
static enum itr_return stm32_tamp_it_handler(struct itr_handler *h);

static void apply_rif_config(void)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);
	bool is_tdcid = false;
	uint32_t seccfgr = 0;
	uint32_t privcfgr = 0;
	uint32_t access_mask_sec_reg = 0;
	uint32_t access_mask_priv_reg = 0;
	unsigned int i = 0;

	if (stm32_rifsc_check_tdcid(&is_tdcid))
		panic();

	/* Build access masks for _TAMP_PRIVCFGR and _TAMP_SECCFGR */
	for (i = 0; i < TAMP_RIF_RESOURCES; i++) {
		if (BIT(i) & stm32_tamp.pdata.conf_data.access_mask[0]) {
			switch (i) {
			case 0:
				access_mask_sec_reg |= _TAMP_SECCFGR_TAMPSEC;
				access_mask_priv_reg |= _TAMP_PRIVCFG_TAMPPRIV;
				break;
			case 1:
				access_mask_sec_reg |= _TAMP_SECCFGR_CNT1SEC;
				access_mask_priv_reg |= _TAMP_PRIVCFG_CNT1PRIV;
				access_mask_priv_reg |= _TAMP_PRIVCFG_BKPRWPRIV;
				break;
			case 2:
				access_mask_sec_reg |= _TAMP_SECCFGR_CNT2SEC;
				access_mask_priv_reg |= _TAMP_PRIVCFG_CNT2PRIV;
				access_mask_priv_reg |= _TAMP_PRIVCFG_BKPWPRIV;
				break;
			default:
				panic();
			}
		}
	}

	/*
	 * When TDCID, OP-TEE should be the one to set the CID filtering
	 * configuration. Clearing previous configuration prevents
	 * undesired events during the only legitimate configuration.
	 */
	if (is_tdcid) {
		for (i = 0; i < TAMP_RIF_RESOURCES; i++)
			if (BIT(i) & stm32_tamp.pdata.conf_data.access_mask[0])
				io_clrbits32(base + _TAMP_CIDCFGR(i),
					     _TAMP_CIDCFGR_CONF_MASK);
	}

	seccfgr = stm32_tamp.pdata.conf_data.sec_conf[0];
	seccfgr = (seccfgr & _TAMP_SECCFGR_RIF_TAMP_SEC ?
		   _TAMP_SECCFGR_TAMPSEC : 0) |
		  (seccfgr & _TAMP_SECCFGR_RIF_COUNT_1 ?
		   _TAMP_SECCFGR_CNT1SEC : 0) |
		  (seccfgr & _TAMP_SECCFGR_RIF_COUNT_2 ?
		   _TAMP_SECCFGR_CNT2SEC : 0);

	privcfgr = stm32_tamp.pdata.conf_data.priv_conf[0];
	privcfgr = (privcfgr & _TAMP_PRIVCFGR_RIF_TAMP_PRIV ?
		    _TAMP_PRIVCFG_TAMPPRIV : 0) |
		   (privcfgr & _TAMP_PRIVCFGR_RIF_R1 ?
		    (_TAMP_PRIVCFG_CNT1PRIV | _TAMP_PRIVCFG_BKPRWPRIV) : 0) |
		   (privcfgr & _TAMP_PRIVCFGR_RIF_R2 ?
		    (_TAMP_PRIVCFG_CNT2PRIV | _TAMP_PRIVCFG_BKPWPRIV) : 0);

	/* Security and privilege RIF configuration */
	io_clrsetbits32(base + _TAMP_PRIVCFGR,
			_TAMP_PRIVCFGR_MASK & access_mask_sec_reg, privcfgr);
	io_clrsetbits32(base + _TAMP_SECCFGR,
			_TAMP_SECCFGR_BUT_BKP_MASK & access_mask_priv_reg,
			seccfgr);

	if (!is_tdcid)
		return;

	for (i = 0; i < TAMP_RIF_RESOURCES; i++) {
		if (!(BIT(i) & stm32_tamp.pdata.conf_data.access_mask[0]))
			continue;

		io_clrsetbits32(base + _TAMP_CIDCFGR(i),
				_TAMP_CIDCFGR_CONF_MASK,
				stm32_tamp.pdata.conf_data.cid_confs[i]);
	}
}

static TEE_Result stm32_tamp_apply_bkpr_rif_conf(void)
{
	struct stm32_bkpregs_conf *bkpregs_conf = stm32_tamp.pdata.bkpregs_conf;
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);
	int i = 0;

	if (!bkpregs_conf)
		panic("No backup register configuration");

	for (i = 0; i < 4; i++) {
		if (bkpregs_conf->rif_offsets[i] >
		    (stm32_tamp.hwconf1 & _TAMP_HWCFGR1_BKPREG))
			return TEE_ERROR_NOT_SUPPORTED;
	}

	/* Fill the 3 TAMP_BKPRIFRx registers */
	io_clrsetbits32(base + _TAMP_BKPRIFR(1), _TAMP_BKPRIFR_1_MASK,
			bkpregs_conf->rif_offsets[0]);
	io_clrsetbits32(base + _TAMP_BKPRIFR(2), _TAMP_BKPRIFR_2_MASK,
			bkpregs_conf->rif_offsets[1]);
	io_clrsetbits32(base + _TAMP_BKPRIFR(3), _TAMP_BKPRIFR_3_MASK,
			bkpregs_conf->rif_offsets[2] |
			(bkpregs_conf->rif_offsets[3] <<
			 _TAMP_BKPRIFR_ZONE3_RIF2_SHIFT));

	DMSG("Backup registers mapping :");
	DMSG("********START of zone 1********");
	DMSG("Protection Zone 1-RIF1 begins at register: 0");
	DMSG("Protection Zone 1-RIF2 begins at register: %"PRIu32,
	     bkpregs_conf->rif_offsets[0]);
	DMSG("Protection Zone 1-RIF2 ends at register: %"PRIu32,
	     bkpregs_conf->nb_zone1_regs ? bkpregs_conf->nb_zone1_regs - 1 : 0);
	DMSG("********END of zone 1********");
	DMSG("********START of zone 2********");
	DMSG("Protection Zone 2-RIF1 begins at register: %"PRIu32,
	     bkpregs_conf->nb_zone1_regs);
	DMSG("Protection Zone 2-RIF2 begins at register: %"PRIu32,
	     bkpregs_conf->rif_offsets[1]);
	DMSG("Protection Zone 2-RIF2 ends at register: %"PRIu32,
	     bkpregs_conf->rif_offsets[1] > bkpregs_conf->nb_zone1_regs ?
	     bkpregs_conf->nb_zone2_regs - 1 : 0);
	DMSG("********END of zone 2********");
	DMSG("********START of zone 3********");
	DMSG("Protection Zone 3-RIF1 begins at register: %"PRIu32,
	     bkpregs_conf->nb_zone2_regs);
	DMSG("Protection Zone 3-RIF0 begins at register: %"PRIu32,
	     bkpregs_conf->rif_offsets[2]);
	DMSG("Protection Zone 3-RIF2 begins at register: %"PRIu32,
	     bkpregs_conf->rif_offsets[3]);
	DMSG("Protection Zone 3-RIF2 ends at the last register: 128");
	DMSG("********END of zone 3********");

	return TEE_SUCCESS;
}

static void stm32_tamp_set_secret_list(struct stm32_tamp_instance *tamp,
				       uint32_t secret_list_conf)
{
	vaddr_t base = io_pa_or_va(&tamp->pdata.base, 1);

	if (tamp->pdata.compat &&
	    (tamp->pdata.compat->tags & TAMP_HAS_REGISTER_ERCFGR)) {

		io_clrsetbits32(base + _TAMP_ERCFGR,
				_TAMP_ERCFGR_ERCFG_MASK,
				secret_list_conf & _TAMP_ERCFGR_ERCFG_MASK);
	}
}

static void stm32_tamp_set_secure(struct stm32_tamp_instance *tamp,
				  uint32_t mode)
{
	vaddr_t base = io_pa_or_va(&tamp->pdata.base, 1);

	if (tamp->pdata.compat &&
	    (tamp->pdata.compat->tags & TAMP_HAS_REGISTER_SECCFGR)) {
		io_clrsetbits32(base + _TAMP_SECCFGR,
				_TAMP_SECCFGR_BUT_BKP_MASK,
				mode & _TAMP_SECCFGR_BUT_BKP_MASK);
	} else {
		/*
		 * Note: MP15 doesn't use SECCFG register
		 * and inverts the secure bit
		 */
		if (mode & _TAMP_SECCFGR_TAMPSEC)
			io_clrbits32(base + _TAMP_SMCR, _TAMP_SMCR_DPROT);
		else
			io_setbits32(base + _TAMP_SMCR, _TAMP_SMCR_DPROT);
	}
}

static void stm32_tamp_set_privilege(struct stm32_tamp_instance *tamp,
				     uint32_t mode)
{
	vaddr_t base = io_pa_or_va(&tamp->pdata.base, 1);

	if (tamp->pdata.compat &&
	    (tamp->pdata.compat->tags & TAMP_HAS_REGISTER_PRIVCFGR))
		io_clrsetbits32(base + _TAMP_PRIVCFGR, _TAMP_PRIVCFGR_MASK,
				mode & _TAMP_PRIVCFGR_MASK);
}

static void stm32_tamp_set_pins(vaddr_t base, uint32_t mode)
{
	io_setbits32(base + _TAMP_OR, mode);
}

static TEE_Result stm32_tamp_set_seed(vaddr_t base)
{
	/* Need RNG access. */
	uint64_t timeout_ref = 0;
	int idx = 0;

	for (idx = 0; idx < 4; idx++) {
		uint32_t rnd = 0;

