DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
		/*
		 * 3 zones with 7 subzones in total(6 offsets):
		 * - 2 zone offsets
		 * - 4 subzones offsets
		 */
		if (lenp != sizeof(uint32_t) * 7)
			panic("Incorrect bkpregs configuration");

		/* Backup registers zone 1 */
		pdata->bkpregs_conf->rif_offsets[0] = fdt32_to_cpu(cuint[0]);
		pdata->bkpregs_conf->nb_zone1_regs = fdt32_to_cpu(cuint[0]) +
						     fdt32_to_cpu(cuint[1]);

		bkpregs_count = pdata->bkpregs_conf->nb_zone1_regs;

		/* Backup registers zone 2 */
		pdata->bkpregs_conf->rif_offsets[1] = bkpregs_count +
						      fdt32_to_cpu(cuint[2]);
		pdata->bkpregs_conf->nb_zone2_regs = bkpregs_count +
						     fdt32_to_cpu(cuint[2]) +
						     fdt32_to_cpu(cuint[3]);

		bkpregs_count = pdata->bkpregs_conf->nb_zone2_regs;

		/* Backup registers zone 3 */
		pdata->bkpregs_conf->rif_offsets[2] = bkpregs_count +
						      fdt32_to_cpu(cuint[4]);
		pdata->bkpregs_conf->rif_offsets[3] = bkpregs_count +
						      fdt32_to_cpu(cuint[4]) +
						      fdt32_to_cpu(cuint[5]);
	}
}

/*
 * stm32_tamp_set_secure_bkprwregs: Configure backup registers zone.
 * registers in zone 1: read/write only in secure mode
 *              zone 2: write only in secure mode, read in secure and
 *                       non-secure mode
 *              zone 3: read/write in secure and non-secure mode
 *
 * return TEE_ERROR_NOT_SUPPORTED:  if zone 1 and/or zone 2 definition are out
 *                                  of range.
 *        TEE_ERROR_BAD_PARAMETERS: if bkpregs_cond is NULL.
 *        TEE_SUCCESS             : if OK.
 */
static TEE_Result stm32_tamp_set_secure_bkpregs(void)
{
	struct stm32_bkpregs_conf *bkpregs_conf = stm32_tamp.pdata.bkpregs_conf;
	uint32_t first_z2 = 0;
	uint32_t first_z3 = 0;
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (!bkpregs_conf)
		return TEE_ERROR_BAD_PARAMETERS;

	first_z2 = bkpregs_conf->nb_zone1_regs;
	first_z3 = bkpregs_conf->nb_zone2_regs;

	if ((first_z2 > (stm32_tamp.hwconf1 & _TAMP_HWCFGR1_BKPREG)) ||
	    (first_z3 > (stm32_tamp.hwconf1 & _TAMP_HWCFGR1_BKPREG)))
		return TEE_ERROR_BAD_PARAMETERS;

	if (stm32_tamp.pdata.compat &&
	    (stm32_tamp.pdata.compat->tags & TAMP_HAS_REGISTER_SECCFGR)) {
		io_clrsetbits32(base + _TAMP_SECCFGR,
				_TAMP_SECCFGR_BKPRWSEC_MASK,
				(first_z2 << _TAMP_SECCFGR_BKPRWSEC_SHIFT) &
				_TAMP_SECCFGR_BKPRWSEC_MASK);

		io_clrsetbits32(base + _TAMP_SECCFGR,
				_TAMP_SECCFGR_BKPWSEC_MASK,
				(first_z3 << _TAMP_SECCFGR_BKPWSEC_SHIFT) &
				_TAMP_SECCFGR_BKPWSEC_MASK);
	} else {
		io_clrsetbits32(base + _TAMP_SMCR,
				_TAMP_SMCR_BKPRWDPROT_MASK,
				(first_z2 << _TAMP_SMCR_BKPRWDPROT_SHIFT) &
				_TAMP_SMCR_BKPRWDPROT_MASK);

		io_clrsetbits32(base + _TAMP_SMCR,
				_TAMP_SMCR_BKPWDPROT_MASK,
				(first_z3 << _TAMP_SMCR_BKPWDPROT_SHIFT) &
				_TAMP_SMCR_BKPWDPROT_MASK);
	}

	return TEE_SUCCESS;
}

/*
 * Count number of 1 in bitmask
 * Cannot use __builtin_popcount(): libgcc.a for ARMV7 use hardfloat ABI,
 * but optee is compiled with softfloat ABI.
 */
static int popcount(uint32_t bitmask)
{
	int nb = 0;

	while (bitmask) {
		if (bitmask & 1)
			nb++;
		bitmask >>= 1;
	}

	return nb;
}

static void stm32_tamp_set_atper(uint32_t pins_out_bits, uint32_t *atcr1)
{
	uint32_t conf = 0;

	switch (popcount(pins_out_bits)) {
	case 0:
		fallthrough;
	case 1:
		conf = 0;
		break;
	case 2:
		conf = 1;
		break;
	case 3:
		fallthrough;
	case 4:
		conf = 2;
		break;
	default:
		conf = 3;
		break;
	}

	*atcr1 |= (conf << _TAMP_ATCR1_ATPER_SHIFT) & _TAMP_ATCR1_ATPER_MASK;
}

static TEE_Result stm32_tamp_set_config(void)
{
	TEE_Result ret = TEE_SUCCESS;
	size_t i = 0;
	uint32_t cr1 = 0;
	uint32_t cr2 = 0;
	uint32_t cr3 = 0;
	uint32_t atcr1 = 0;
	uint32_t atcr2 = 0;
	uint32_t fltcr = 0;
	uint32_t ier = 0;

	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (!stm32_tamp.pdata.compat ||
	    !stm32_tamp.pdata.compat->int_tamp ||
	    !stm32_tamp.pdata.compat->ext_tamp)
		return TEE_ERROR_BAD_STATE;

	/* Set passive filter configuration */
	fltcr = stm32_tamp.pdata.passive_conf;

	/* Set active mode configuration */
	atcr1 = stm32_tamp.pdata.active_conf & _TAMP_ATCR1_COMMON_MASK;
	stm32_tamp_set_atper(stm32_tamp.pdata.out_pins, &atcr1);

	for (i = 0; i < stm32_tamp.pdata.compat->int_tamp_size; i++) {
		ret = stm32_tamp_set_int_config(stm32_tamp.pdata.compat, i,
						&cr1, &cr3, &ier);
		if (ret)
			return ret;
	}

	for (i = 0; i < stm32_tamp.pdata.compat->ext_tamp_size; i++) {
		ret = stm32_tamp_set_ext_config(stm32_tamp.pdata.compat, i,
						&cr1, &cr2, &atcr1, &atcr2,
						&ier);
		if (ret)
			return ret;
	}

	/*
	 * We apply configuration all in a row:
	 * As for active ext tamper "all the needed tampers must be enabled in
	 * the same write access".
	 */
	io_write32(base + _TAMP_FLTCR, fltcr);
	FMSG("Set passive conf %08x", fltcr);

	/* Active configuration applied only if not already done. */
	if (((io_read32(base + _TAMP_ATOR) & _TAMP_INITS) != _TAMP_INITS)) {
		io_write32(base + _TAMP_ATCR1, atcr1);
		FMSG("Set active conf1 %08x", atcr1);

		if (stm32_tamp.pdata.compat->tags & TAMP_HAS_REGISTER_ATCR2) {
			io_write32(base + _TAMP_ATCR2, atcr2);
			FMSG("Set active conf2 %08x", atcr2);
		}
	}

	io_write32(base + _TAMP_CR1, cr1);
	io_write32(base + _TAMP_CR2, cr2);
	if (stm32_tamp.pdata.compat->tags & TAMP_HAS_REGISTER_CR3)
		io_write32(base + _TAMP_CR3, cr3);

	/* If active tamper we reinit the seed. */
	if (stm32_tamp.pdata.active_conf) {
		if (stm32_tamp_set_seed(base) != TEE_SUCCESS) {
			EMSG("Active tamper: SEED not initialized");
			return TEE_ERROR_BAD_STATE;
		}
	}

	/*
	 * We installed callback,
	 * we force managing TAMPER events that could have occurred while boot.
	 */
	stm32_tamp_it_handler(stm32_tamp.itr);

	/* Enable interrupts. */
	io_write32(base + _TAMP_IER, ier);

	return TEE_SUCCESS;
}

/*
 * If ETAMP(id) event generates a trigger event, this
 * ETAMP(id) is masked and internally cleared by hardware.
 * The secrets are not erased.
 */
static TEE_Result __maybe_unused stm32_tamp_set_mask(enum stm32_tamp_id id)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	/* Only EXT_TAMP1, EXT_TAMP2, EXT_TAMP3 can be masked. */
	if (id < EXT_TAMP1 || id > (EXT_TAMP1 + _TAMP_CR2_ETAMPMSK_MAX_ID))
		return TEE_ERROR_BAD_PARAMETERS;

	/* We cannot mask the event if pending. */
	if (io_read32(base + _TAMP_SR) & _TAMP_SR_ETAMP(id))
		return TEE_ERROR_BAD_STATE;

	/* We disable the IT */
	io_clrbits32(base + _TAMP_IER, _TAMP_IER_ETAMP(id));
	/* We mask the event */
	io_setbits32(base + _TAMP_CR2, _TAMP_CR2_ETAMPMSK(id));

	return TEE_SUCCESS;
}

