DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
/*
 * Move to a normal ETAMP interrupt:
 * ETAMP(id) event generates a trigger event and
 * ETAMP(id) must be cleared by software to allow
 * next tamper event detection.
 */
static TEE_Result __maybe_unused stm32_tamp_unset_mask(enum stm32_tamp_id id)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	/* Only EXT_TAMP1, EXT_TAMP2, EXT_TAMP3 can be masked. */
	if (id < EXT_TAMP1 || id > (EXT_TAMP1 + _TAMP_CR2_ETAMPMSK_MAX_ID))
		return TEE_ERROR_BAD_PARAMETERS;

	/* We unmask the event */
	io_clrbits32(base + _TAMP_CR2, _TAMP_CR2_ETAMPMSK(id));
	/* We enable the IT */
	io_setbits32(base + _TAMP_IER, _TAMP_IER_ETAMP(id));

	return TEE_SUCCESS;
}

static TEE_Result __maybe_unused stm32_tamp_write_mcounter(int cnt_idx)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (cnt_idx < 0 || !stm32_tamp.pdata.compat ||
	    cnt_idx > stm32_tamp.pdata.compat->nb_monotonic_counter)
		return TEE_ERROR_BAD_PARAMETERS;

	io_write32(base + _TAMP_COUNTR + cnt_idx * sizeof(uint32_t), 1);

	return TEE_SUCCESS;
}

static uint32_t __maybe_unused stm32_tamp_read_mcounter(int cnt_idx)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (cnt_idx < 0 || !stm32_tamp.pdata.compat ||
	    cnt_idx > stm32_tamp.pdata.compat->nb_monotonic_counter)
		return U(0);

	return io_read32(base + _TAMP_COUNTR + cnt_idx * sizeof(uint32_t));
}

static TEE_Result stm32_tamp_configure_int(struct stm32_tamp_conf *tamp_int,
					   uint32_t mode,
					   uint32_t (*cb)(int id))
{
	TEE_Result res = TEE_ERROR_GENERIC;

	if (mode & TAMP_EVT_MASK)
		return TEE_ERROR_BAD_PARAMETERS;

	res = stm32_activate_internal_tamper(tamp_int->id);
	if (res) {
		EMSG("Skip tamper for ID:%u", tamp_int->id);
		return res;
	}

	tamp_int->mode |= (mode & TAMP_MODE_MASK);
	tamp_int->func = cb;

	return TEE_SUCCESS;
}

static TEE_Result stm32_tamp_configure_ext(struct stm32_tamp_conf *tamp_ext,
					   uint32_t mode,
					   uint32_t (*cb)(int id))
{
	enum stm32_tamp_id id = tamp_ext->id;

	if (mode & TAMP_EVT_MASK &&
	    (id < EXT_TAMP1 || id > (EXT_TAMP1 + _TAMP_CR2_ETAMPMSK_MAX_ID)))
		return TEE_ERROR_BAD_PARAMETERS;

	if (!(tamp_ext->mode & TAMP_IN_DT))
		return TEE_ERROR_ITEM_NOT_FOUND;

	tamp_ext->mode |= (mode & TAMP_MODE_MASK);
	tamp_ext->func = cb;

	return TEE_SUCCESS;
}

/*
 * stm32_tamp_activate_tamp: Configure and activate one tamper (internal or
 * external).
 *
 * @id: tamper ID
 * @mode: bitmask from TAMPER modes define:
 *       TAMP_ERASE/TAMP_NOERASE:
 *            TAMP_ERASE: when this tamper event is triggered; secrets are
 *            erased.
 *            TAMP_NOERASE: when this event is triggered; cryptographic
 *            and some secure peripherals are locked until the event is
 *            acknowledged. If the callback confirms the TAMPER, it
 *            can manually erase secrets with stm32_tamp_erase_secrets().
 *       TAMP_NO_EVT_MASK/TAMP_EVT_MASK:
 *            TAMP_NO_EVT_MASK: normal behavior.
 *            TAMP_EVT_MASK: if the event is triggered, the event is masked and
 *            internally cleared by hardware. Secrets are not erased. Only
 *            applicable for some external tampers. This defines only the status
 *            at boot. To change mask while runtime: stm32_tamp_set_mask() and
 *            stm32_tamp_unset_mask() can be used.
 * @callback: function to call when a tamper event is raised (cannot be NULL).
 *            It is called in interrupt context and returns a bitmask defining
 *            the action to take by the driver:
 *            TAMP_CB_RESET: will reset the board.
 *            TAMP_CB_ACK: this specific tamper is acknowledged (in case
 *            of no-erase tamper, blocked secret are unblocked).
 *
 * return: TEE_ERROR_BAD_PARAMETERS:
 *                   if @id is not a valid tamper ID,
 *                   if @callback is NULL,
 *                   if TAMP_EVT_MASK @mode is set for an unsupported @id.
 *         TEE_ERROR BAD_STATE
 *                   if driver was not previously initialized.
 *         TEE_ERROR ITEM_NOT_FOUND
 *                   if the activated external tamper was not previously
 *                   defined in the device tree.
 *         else TEE_SUCCESS.
 */
static TEE_Result stm32_tamp_activate_tamp(enum stm32_tamp_id id, uint32_t mode,
					   uint32_t (*cb)(int id))
{
	size_t i = 0;
	struct stm32_tamp_conf *tamp_conf = NULL;

	if (!stm32_tamp.pdata.compat)
		return TEE_ERROR_BAD_STATE;

	if (!cb)
		return TEE_ERROR_BAD_PARAMETERS;

	/* Find internal Tamp struct */
	for (i = 0; i < stm32_tamp.pdata.compat->int_tamp_size; i++)
		if (stm32_tamp.pdata.compat->int_tamp[i].id == id) {
			tamp_conf = &stm32_tamp.pdata.compat->int_tamp[i];
			return stm32_tamp_configure_int(tamp_conf, mode, cb);
		}

	/* Find external Tamp struct */
	for (i = 0; i < stm32_tamp.pdata.compat->ext_tamp_size; i++)
		if (stm32_tamp.pdata.compat->ext_tamp[i].id == id) {
			tamp_conf = &stm32_tamp.pdata.compat->ext_tamp[i];
			return stm32_tamp_configure_ext(tamp_conf, mode, cb);
		}

	EMSG("Did not find existing tamper for ID:%u", id);

	return TEE_ERROR_BAD_PARAMETERS;
}

static bool __maybe_unused stm32_tamp_are_secrets_blocked(void)
{
	if (stm32_tamp.pdata.compat &&
	    (stm32_tamp.pdata.compat->tags & TAMP_HAS_CR2_SECRET_STATUS)) {
		vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

		return (((io_read32(base + _TAMP_CR2) &
			  _TAMP_CR2_BKBLOCK) == _TAMP_CR2_BKBLOCK) ||
			io_read32(base + _TAMP_SR));
	} else {
		return false;
	}
}

static void __maybe_unused stm32_tamp_block_secrets(void)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (stm32_tamp.pdata.compat &&
	    (stm32_tamp.pdata.compat->tags & TAMP_HAS_CR2_SECRET_STATUS))
		io_setbits32(base + _TAMP_CR2, _TAMP_CR2_BKBLOCK);
}

static void __maybe_unused stm32_tamp_unblock_secrets(void)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (stm32_tamp.pdata.compat &&
	    (stm32_tamp.pdata.compat->tags & TAMP_HAS_CR2_SECRET_STATUS))
		io_clrbits32(base + _TAMP_CR2, _TAMP_CR2_BKBLOCK);
}

static void __maybe_unused stm32_tamp_erase_secrets(void)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

