DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
	if (stm32_tamp.pdata.compat &&
	    (stm32_tamp.pdata.compat->tags & TAMP_HAS_CR2_SECRET_STATUS))
		io_setbits32(base + _TAMP_CR2, _TAMP_CR2_BKERASE);
}

static void __maybe_unused stm32_tamp_lock_boot_hardware_key(void)
{
	vaddr_t base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	if (stm32_tamp.pdata.compat &&
	    (stm32_tamp.pdata.compat->tags & TAMP_HAS_REGISTER_SECCFGR))
		io_setbits32(base + _TAMP_SECCFGR, _TAMP_SECCFGR_BHKLOCK);
}

static void stm32_tamp_handle_lse_tamper(void)
{
	vaddr_t rcc_base = stm32_rcc_base();

	/* Disable the LSE CSS feature */
	io_clrbits32(rcc_base + RCC_BDCR, RCC_BDCR_LSECSSON);

	/* Disable the LSE clock */
	io_clrbits32(rcc_base + RCC_BDCR, RCC_BDCR_LSEON);

	/* Clear the associated error flag */
#if defined(CFG_STM32MP13) || defined(CFG_STM32MP15)
	io_setbits32(rcc_base + RCC_MP_CIFR, RCC_MP_CIFR_LSECSSF);
#else
	if (io_read32(rcc_base + RCC_C1CIFCLRR) & RCC_C1CIFCLRR_LSECSSF)
		io_setbits32((rcc_base + RCC_C1CIFCLRR), RCC_C1CIFCLRR_LSECSSF);
#endif

	/*
	 * Fixme: Add logic to handle the LSE tamper here (e.g change RTC clock
	 * source instead). This part is implementation specific.
	 */

	io_clrbits32(rcc_base + RCC_BDCR, RCC_BDCR_RTCCKEN);
}

static enum itr_return stm32_tamp_it_handler(struct itr_handler *h)
{
	struct stm32_tamp_instance *tamp = h->data;
	vaddr_t base = io_pa_or_va(&tamp->pdata.base, 1);
	uint32_t it = io_read32(base + _TAMP_SR);
	uint32_t int_it = it & _TAMP_SR_ITAMPXF_MASK;
	uint32_t ext_it = it & _TAMP_SR_ETAMPXF_MASK;
	size_t i = 0;
	struct stm32_rtc_time tamp_ts = { };
	bool ts_enabled = false;

	if (stm32_rtc_is_timestamp_enable(&ts_enabled))
		panic();

	if (ts_enabled && it) {
		stm32_rtc_get_timestamp(&tamp_ts);
		FMSG("Tamper Event Occurred");
		FMSG("Date: %u/%u\n \t Time: %u:%u:%u",
		     tamp_ts.day, tamp_ts.month, tamp_ts.hour,
		     tamp_ts.min, tamp_ts.sec);
	}

	while (int_it && i < stm32_tamp.pdata.compat->int_tamp_size) {
		uint32_t id = tamp->pdata.compat->int_tamp[i].id;

		if (int_it & _TAMP_SR_ITAMP(id)) {
			uint32_t ret = 0;

			int_it &= ~_TAMP_SR_ITAMP(id);

			if (tamp->pdata.compat->int_tamp[i].func)
				ret = tamp->pdata.compat->int_tamp[i].func(id);

			if (ret & TAMP_CB_ACK)
				io_setbits32(base + _TAMP_SCR,
					     _TAMP_SCR_ITAMP(id));

			/* Handler LSE monitoring tamper */
			if (id - INT_TAMP1 + 1 == INT_TAMPER_LSE_MONITORING)
				stm32_tamp_handle_lse_tamper();

			if (ret & TAMP_CB_RESET)
				do_reset("TAMPER");
		}
		i++;
	}

	i = 0;
	/* External tamper interrupt */
	while (ext_it && i < stm32_tamp.pdata.compat->ext_tamp_size) {
		uint32_t id = tamp->pdata.compat->ext_tamp[i].id;

		if (ext_it & _TAMP_SR_ETAMP(id)) {
			uint32_t ret = 0;

			ext_it &= ~_TAMP_SR_ETAMP(id);

			if (tamp->pdata.compat->ext_tamp[i].func)
				ret = tamp->pdata.compat->ext_tamp[i].func(id);

			if (ret & TAMP_CB_ACK)
				io_setbits32(base + _TAMP_SCR,
					     _TAMP_SCR_ETAMP(id));

			if (ret & TAMP_CB_RESET)
				do_reset("TAMPER");
		}
		i++;
	}

	return ITRR_HANDLED;
}

static void stm32_tamp_configure_pin(uint32_t id,
				     struct stm32_pinctrl *pinctrl, bool out,
				     struct stm32_tamp_platdata *pdata)
{
	size_t i = 0;
	struct stm32_tamp_compat *compat = pdata->compat;

	if (!compat)
		return;

	/* Configure option registers */
	for (i = 0; i < compat->pin_map_size; i++)
		if (id == compat->pin_map[i].id &&
		    pinctrl->bank == compat->pin_map[i].bank &&
		    pinctrl->pin == compat->pin_map[i].pin &&
		    !out == !compat->pin_map[i].out) {
			pdata->pins_conf |= compat->pin_map[i].conf;
			break;
		}

	/* TAMPER pins are always secure (without effect, but keep coherency) */
	if (stm32_gpio_set_secure_cfg(pinctrl->bank, pinctrl->pin, true))
		panic();
}

static TEE_Result
stm32_tamp_configure_pin_from_dt(const void *fdt, int node,
				 struct stm32_tamp_platdata *pdata)
{
	TEE_Result res = TEE_SUCCESS;
	struct stm32_pinctrl *pinctrl[2] = { };
	struct stm32_pinctrl_list *pinctrl_list = NULL;
	size_t i = 0;
	enum stm32_tamp_id id = INVALID_TAMP;
	enum stm32_tamp_out_id out_id = INVALID_OUT_TAMP;
	struct stm32_tamp_conf *tamp_ext = NULL;
	const fdt32_t *cuint = NULL;
	const fdt32_t *tampid = NULL;
	int lenp = 0;
	int pinnode = -1;
	bool active = false;

	/*
	 * First pin in the "pinctrl-0" node is the EXT_TAMP.
	 * If two pins are defined, first is a pin for an active tamper and the
	 * second is the OUT pin linked with the first.
	 * If only one found, this is a pin for a passive tamper.
	 */
	res = stm32_pinctrl_dt_get_by_index(fdt, node, 0, &pinctrl_list);
	if (res)
		return res;

	pinctrl[0] = STAILQ_FIRST(pinctrl_list);
	pinctrl[1] = STAILQ_NEXT(pinctrl[0], link);

	cuint = fdt_getprop(fdt, node, "pinctrl-0", &lenp);
	if (!pinctrl[0] || !cuint || (pinctrl[1] &&
				      (lenp / sizeof(*cuint)) < 2))
		return TEE_ERROR_BAD_PARAMETERS;

	if (pinctrl[1]) {
		pinnode = fdt_node_offset_by_phandle(fdt,
						     fdt32_to_cpu(cuint[1]));
		tampid = fdt_getprop(fdt, fdt_first_subnode(fdt, pinnode),
				     "st,tamp-id", NULL);
		if (!tampid)
			return TEE_ERROR_BAD_PARAMETERS;

		active = true;
		out_id = OUT_TAMP1 + fdt32_to_cpu(*tampid) - 1;
		if (out_id - OUT_TAMP1 > pdata->compat->ext_tamp_size)
			return TEE_ERROR_BAD_PARAMETERS;

		stm32_tamp_configure_pin(out_id, pinctrl[1], true, pdata);
	}

	/* We now configure first pin */
	pinnode = fdt_node_offset_by_phandle(fdt, fdt32_to_cpu(cuint[0]));
	tampid = fdt_getprop(fdt, fdt_first_subnode(fdt, pinnode),
			     "st,tamp-id", NULL);
	if (!tampid)
		return TEE_ERROR_BAD_PARAMETERS;

	id = fdt32_to_cpu(*tampid) + EXT_TAMP1 - 1;

	/* Find external Tamp struct */
	for (i = 0; i < pdata->compat->ext_tamp_size; i++) {
		if (pdata->compat->ext_tamp[i].id == id) {
			tamp_ext = &pdata->compat->ext_tamp[i];
			break;
		}
	}

	if (!tamp_ext)
		return TEE_ERROR_BAD_PARAMETERS;

	if (active) {
		tamp_ext->mode |= TAMP_ACTIVE;
		tamp_ext->out_id = out_id;
		pdata->out_pins |= BIT(tamp_ext->out_id - OUT_TAMP1);

		if (out_id - OUT_TAMP1 != id - EXT_TAMP1)
			pdata->active_conf |= _TAMP_ATCR1_ATOSHARE;
	} else {
		if (fdt_getprop(fdt, node, "st,trig-on", NULL))
			tamp_ext->mode |= TAMP_TRIG_ON;
	}

	tamp_ext->mode |= TAMP_IN_DT;

	stm32_tamp_configure_pin(id, pinctrl[0], false, pdata);

	return TEE_SUCCESS;
}

static TEE_Result
stm32_tamp_parse_passive_conf(const void *fdt, int node,
			      struct stm32_tamp_platdata *pdata)
{
	const fdt32_t *cuint = NULL;
	uint32_t precharge = 0;
	uint32_t nb_sample = 0;
	uint32_t clk_div = 32768;
	uint32_t conf = 0;

	cuint = fdt_getprop(fdt, node, "st,tamp-passive-precharge", NULL);
	if (cuint)
		precharge = fdt32_to_cpu(*cuint);

	cuint = fdt_getprop(fdt, node, "st,tamp-passive-nb-sample", NULL);
	if (cuint)
		nb_sample = fdt32_to_cpu(*cuint);

	cuint = fdt_getprop(fdt, node, "st,tamp-passive-sample-clk-div", NULL);
	if (cuint)
		clk_div = fdt32_to_cpu(*cuint);

	DMSG("Passive conf from dt: precharge=%"PRIu32", nb_sample=%"PRIu32
	     ", clk_div=%"PRIu32, precharge, nb_sample, clk_div);

	switch (precharge) {
	case 0:
		/* No precharge, => we disable the pull-up */
		conf |= _TAMP_FLTCR_TAMPPUDIS;
		break;
	case 1:
		/* Precharge for one cycle value stay 0 */
		break;
	case 2:
		/* Precharge passive pin 2 cycles */
		conf |= 1 << _TAMP_FLTCR_TAMPPRCH_SHIFT;
		break;
	case 4:
		/* Precharge passive pin 4 cycles */
		conf |= 2 << _TAMP_FLTCR_TAMPPRCH_SHIFT;
		break;
	case 8:
		/* Precharge passive pin 8 cycles */
		conf |= 3 << _TAMP_FLTCR_TAMPPRCH_SHIFT;
		break;
	default:
		return TEE_ERROR_BAD_PARAMETERS;
	}

	switch (nb_sample) {
	case 0:
		/* Activation on edge, no pull-up: value stay 0 */
		break;
	case 2:
		/*
		 * Tamper event is activated after 2 consecutive samples at
		 * active level.
		 */
		conf |= 1 << _TAMP_FLTCR_TAMPFLT_SHIFT;
		break;
	case 4:
		/*
		 * Tamper event is activated after 4 consecutive samples at
		 * active level.
		 */
		conf |= 2 << _TAMP_FLTCR_TAMPFLT_SHIFT;
		break;
	case 8:
		/*
		 * Tamper event is activated after 8 consecutive samples at
		 * active level.
		 */
		conf |= 3 << _TAMP_FLTCR_TAMPFLT_SHIFT;
		break;
	default:
		return TEE_ERROR_BAD_PARAMETERS;
	}

	switch (clk_div) {
	case 32768:
		/* RTCCLK / 32768 (1 Hz when RTCCLK = 32768 Hz): stay 0 */
		break;
	case 16384:
		/* RTCCLK / 16384 (2 Hz when RTCCLK = 32768 Hz) */
		conf |= 1 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	case 8192:
		/* RTCCLK / 8192  (4 Hz when RTCCLK = 32768 Hz) */
		conf |= 2 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	case 4096:
		/* RTCCLK / 4096  (8 Hz when RTCCLK = 32768 Hz) */
		conf |= 3 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	case 2048:
		/* RTCCLK / 2048  (16 Hz when RTCCLK = 32768 Hz) */
		conf |= 4 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	case 1024:
		/* RTCCLK / 1024  (32 Hz when RTCCLK = 32768 Hz) */
		conf |= 5 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	case 512:
		/* RTCCLK / 512   (64 Hz when RTCCLK = 32768 Hz) */
		conf |= 6 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	case 256:
		/* RTCCLK / 256   (128 Hz when RTCCLK = 32768 Hz) */
		conf |= 7 << _TAMP_FLTCR_TAMPFREQ_SHIFT;
		break;
	default:
		return TEE_ERROR_BAD_PARAMETERS;
	}

