DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
	pdata->passive_conf = conf;

	return TEE_SUCCESS;
}

static uint32_t stm32_tamp_itamper_action(int __maybe_unused id)
{
	const char __maybe_unused *tamp_name = NULL;

	if (id >= 0 && ((size_t)id < ARRAY_SIZE(itamper_name)))
		tamp_name = itamper_name[id];

	MSG("Internal tamper %u (%s) occurs", id - INT_TAMP1 + 1, tamp_name);

	return TAMP_CB_ACK_AND_RESET;
}
DECLARE_KEEP_PAGER(stm32_tamp_itamper_action);

static uint32_t stm32_tamp_etamper_action(int id __maybe_unused)
{
	MSG("External tamper %u occurs", id - EXT_TAMP1 + 1);

	return TAMP_CB_ACK_AND_RESET;
}
DECLARE_KEEP_PAGER(stm32_tamp_etamper_action);

static TEE_Result stm32_configure_tamp(const void *fdt, int node)
{
	const fdt32_t *internal_tampers = 0;
	uint32_t i_tampers[INT_TAMP_NB * 2] = { };
	int subnode = -FDT_ERR_NOTFOUND;
	TEE_Result res = TEE_SUCCESS;
	int retval = 0;
	int len = 0;
	int i = 0;

	/* Internal tampers configuration */
	internal_tampers = fdt_getprop(fdt, node, "st,tamp-internal-tampers",
				       &len);
	if (len == -FDT_ERR_NOTFOUND)
		goto skip_int_tamp;
	else if ((internal_tampers && len % (2 * sizeof(uint32_t))) ||
		 !internal_tampers || len / sizeof(uint32_t) > INT_TAMP_NB * 2)
		return TEE_ERROR_BAD_PARAMETERS;

	retval = _fdt_read_uint32_array(fdt, node, "st,tamp-internal-tampers",
					i_tampers, len / sizeof(uint32_t));
	if (retval && retval != -FDT_ERR_NOTFOUND)
		return TEE_ERROR_BAD_PARAMETERS;
	len = len / sizeof(uint32_t);
	for (i = 0; i < len; i += 2) {
		uint32_t i_tamper_id = i_tampers[i] - 1;
		uint32_t i_tamper_mode = i_tampers[i + 1];

		res = stm32_tamp_activate_tamp(i_tamper_id, i_tamper_mode,
					       stm32_tamp_itamper_action);
		if (res)
			return res;
	}

skip_int_tamp:
	fdt_for_each_subnode(subnode, fdt, node) {
		if (fdt_getprop(fdt, subnode, "pinctrl-0", NULL)) {
			const fdt32_t *mode = 0;
			paddr_t reg = 0;

			if (_fdt_get_status(fdt, subnode) == DT_STATUS_DISABLED)
				continue;

			mode = fdt_getprop(fdt, subnode, "st,tamp-mode",
					   NULL);
			if (!mode)
				continue;

			res =
			stm32_tamp_configure_pin_from_dt(fdt, subnode,
							 &stm32_tamp.pdata);
			if (res)
				return res;

			reg = _fdt_reg_base_address(fdt, subnode);
			if (reg == DT_INFO_INVALID_REG)
				return TEE_ERROR_BAD_PARAMETERS;

			res =
			stm32_tamp_activate_tamp(EXT_TAMP1 + (uint32_t)reg - 1,
						 fdt32_to_cpu(*mode),
						 stm32_tamp_etamper_action);
			if (res)
				return res;
		}
	}

	if (stm32_tamp_set_config())
		panic();

	/* Enable timestamp for tamper */
	if (stm32_rtc_set_tamper_timestamp())
		panic();

	return TEE_SUCCESS;
}

static TEE_Result
stm32_tamp_parse_active_conf(const void *fdt, int node,
			     struct stm32_tamp_platdata *pdata)
{
	const fdt32_t *cuint = NULL;
	uint32_t clk_div = 1;
	uint32_t conf = 0;

	cuint = fdt_getprop(fdt, node, "st,tamp-active-filter", NULL);
	if (cuint)
		conf |= _TAMP_ATCR1_FLTEN;

	/*
	 * Here we will select a divisor for the RTCCLK.
	 * Note that RTCCLK is also divided by (RTC_PRER_PREDIV_A - 1).
	 */
	cuint = fdt_getprop(fdt, node, "st,tamp-active-clk-div", NULL);
	if (cuint)
		clk_div = fdt32_to_cpu(*cuint);

	DMSG("Active conf from dt: %s clk_div=%"PRIu32,
	     (conf & _TAMP_ATCR1_FLTEN) ? "filter" : "no filter", clk_div);

	switch (clk_div) {
	case 1:
		/* RTCCLK / 32768 (1 Hz when RTCCLK = 32768 Hz): stay 0 */
		break;
	case 2:
		/* RTCCLK / 16384 (2 Hz when RTCCLK = 32768 Hz) */
		conf |= 1 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 4:
		/* RTCCLK / 8192  (4 Hz when RTCCLK = 32768 Hz) */
		conf |= 2 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 8:
		/* RTCCLK / 4096  (8 Hz when RTCCLK = 32768 Hz) */
		conf |= 3 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 16:
		/* RTCCLK / 2048  (16 Hz when RTCCLK = 32768 Hz) */
		conf |= 4 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 32:
		/* RTCCLK / 1024  (32 Hz when RTCCLK = 32768 Hz) */
		conf |= 5 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 64:
		/* RTCCLK / 512   (64 Hz when RTCCLK = 32768 Hz) */
		conf |= 6 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 128:
		/* RTCCLK / 256   (128 Hz when RTCCLK = 32768 Hz) */
		conf |= 7 << _TAMP_ATCR1_ATCKSEL_SHIFT;
		break;
	case 2048:
		if (pdata->compat &&
		    (pdata->compat->tags & TAMP_SIZE_ATCR1_ATCKSEL_IS_4)){
			/* RTCCLK/2048 when (PREDIV_A+1) = 128 and (PREDIV_S+1)
			 * is a multiple of 16. */
			conf |=  11 << _TAMP_ATCR1_ATCKSEL_SHIFT;
			break;
		}

		return TEE_ERROR_BAD_PARAMETERS;
	default:
		return TEE_ERROR_BAD_PARAMETERS;
	}

	pdata->active_conf = conf;

	return TEE_SUCCESS;
}

static TEE_Result stm32_tamp_parse_fdt(struct stm32_tamp_platdata *pdata,
				       const void *fdt, int node,
				       const void *compat)
{
	TEE_Result res = TEE_ERROR_GENERIC;
	struct dt_node_info dt_tamp = {};
	bool is_tdcid = false;

	_fdt_fill_device_info(fdt, &dt_tamp, node);

	if (dt_tamp.reg == DT_INFO_INVALID_REG ||
	    dt_tamp.reg_size == DT_INFO_INVALID_REG_SIZE ||
	    dt_tamp.interrupt == DT_INFO_INVALID_INTERRUPT) {
		return TEE_ERROR_BAD_PARAMETERS;
	}

	pdata->compat = (struct stm32_tamp_compat *)compat;

	if (stm32_tamp.pdata.compat->tags & TAMP_HAS_RIF_SUPPORT) {
		res = stm32_rifsc_check_tdcid(&is_tdcid);
		if (res)
			return res;
	}

	pdata->it = dt_tamp.interrupt;
	pdata->base.pa = dt_tamp.reg;
	io_pa_or_va_secure(&pdata->base, dt_tamp.reg_size);

	res = clk_dt_get_by_index(fdt, node, 0, &pdata->clock);
	if (res)
		return res;

	pdata->pins_conf = 0;

	res = stm32_tamp_parse_passive_conf(fdt, node, pdata);
	if (res)
		return res;

	res = stm32_tamp_parse_active_conf(fdt, node, pdata);
	if (res)
		return res;

	if (fdt_getprop(fdt, node, "wakeup-source", NULL))
		pdata->is_wakeup_source = true;

	if (fdt_getprop(fdt, node, "st,tamp-mask-pot-reset", NULL))
		pdata->mask_pot_reset = true;

	if (pdata->compat->tags & TAMP_HAS_RIF_SUPPORT) {
		const fdt32_t *cuint = NULL;
		uint32_t rif_conf = 0;
		unsigned int i = 0;
		int lenp = 0;

		cuint = fdt_getprop(fdt, node, "st,protreg", &lenp);
		if (!cuint)
			panic("No RIF configuration available");

