DanielMartensson/STM32-Computer/Firmware/STM32-Computer-Firmware/CA7/optee-os-3.19.0-r2/optee-os-stm32mp-3.19.0-stm32mp-r2/core/drivers/stm32_tamp.c
		pdata->nb_resources = (unsigned int)(lenp / sizeof(uint32_t));
		assert(pdata->nb_resources <= TAMP_RIF_RESOURCES);

		pdata->conf_data.cid_confs = calloc(TAMP_RIF_RESOURCES,
						    sizeof(uint32_t));
		pdata->conf_data.sec_conf = calloc(1, sizeof(uint32_t));
		pdata->conf_data.priv_conf = calloc(1, sizeof(uint32_t));
		pdata->conf_data.access_mask = calloc(1, sizeof(uint32_t));
		if (!pdata->conf_data.cid_confs || !pdata->conf_data.sec_conf ||
		    !pdata->conf_data.priv_conf ||
		    !pdata->conf_data.access_mask)
			panic("Not enough memory capacity for TAMP RIF config");

		for (i = 0; i < pdata->nb_resources; i++) {
			rif_conf = fdt32_to_cpu(cuint[i]);

			stm32_rif_parse_cfg(rif_conf, &pdata->conf_data,
					    TAMP_NB_MAX_CID_SUPPORTED,
					    TAMP_RIF_RESOURCES);
		}
	}

	parse_bkpregs_dt_conf(pdata, fdt, node);

	if (pdata->is_wakeup_source && IS_ENABLED(CFG_STM32_EXTI)) {
		pdata->exti =
			dt_driver_device_from_node_idx_prop("wakeup-parent",
							    fdt, node, 0,
							    DT_DRIVER_NOTYPE,
							    &res);
		if (res == TEE_ERROR_DEFER_DRIVER_INIT)
			return TEE_ERROR_DEFER_DRIVER_INIT;
		if (res)
			panic("DT property 'wakeup-source' requires 'wakeup-parent'");
	}

	return TEE_SUCCESS;
}

static TEE_Result stm32_tamp_probe(const void *fdt, int node,
				   const void *compat_data)
{
	uint32_t __maybe_unused revision = 0;
	TEE_Result res = TEE_SUCCESS;
	vaddr_t base = 0;
	int subnode = -FDT_ERR_NOTFOUND;

	/* Manage dependency on the RNG driver */
	res = dt_driver_get_crypto();
	if (res)
		return res;

	/* Manage dependency on RTC driver */
	res = stm32_rtc_driver_is_initialized();
	if (res)
		return res;

	res = stm32_tamp_parse_fdt(&stm32_tamp.pdata, fdt, node, compat_data);
	if (res)
		return res;

	/* Init Tamp clock */
	res = clk_enable(stm32_tamp.pdata.clock);
	if (res)
		return res;

	base = io_pa_or_va(&stm32_tamp.pdata.base, 1);

	stm32_tamp.hwconf1 = io_read32(base + _TAMP_HWCFGR1);
	stm32_tamp.hwconf2 = io_read32(base + _TAMP_HWCFGR2);

	revision = io_read32(base + _TAMP_VERR);
	FMSG("STM32 TAMPER V%"PRIx32".%"PRIu32,
	     (revision & _TAMP_VERR_MAJREV) >> 4, revision & _TAMP_VERR_MINREV);

	if (!(stm32_tamp.hwconf2 & _TAMP_HWCFGR2_TZ)) {
		EMSG("TAMP doesn't support TrustZone");
		res = TEE_ERROR_NOT_SUPPORTED;
		goto err;
	}

#ifdef CFG_STM32MP25
	if (stm32_tamp.pdata.mask_pot_reset)
		stm32mp_syscfg_write(SYSCFG_POTTAMPRSTCR, BIT(0), BIT(0));
#endif /* CFG_STM32MP25 */

	/*
	 * Select extra IP to add in the deleted/blocked IP in case of
	 * tamper event
	 *
	 * No IP added.
	 */
	stm32_tamp_set_secret_list(&stm32_tamp, 0);

	if (stm32_tamp.pdata.compat->tags & TAMP_HAS_RIF_SUPPORT) {
		apply_rif_config();

		if (stm32_tamp.pdata.bkpregs_conf) {
			res = stm32_tamp_apply_bkpr_rif_conf();
			if (res)
				goto err;
		}
	} else {
		/*
		 * Select access in secure or unsecure
		 *
		 * IP is always SECURE, on mp13 both counter can be accessed
		 * from secure and unsecure world.
		 */
		stm32_tamp_set_secure(&stm32_tamp, _TAMP_SECCFGR_TAMPSEC);

		/*
		 * Select access in privileged mode or unprivileged mode
		 *
		 * TAMP ip need secure access,
		 * backup register zone 1 can be read/written only from secure
		 * backup register zone 2 can be written only from secure.
		 * monotic counter can be read/written from secure and unsecure.
		 */
		stm32_tamp_set_privilege(&stm32_tamp, _TAMP_PRIVCFG_TAMPPRIV |
					 _TAMP_PRIVCFG_BKPRWPRIV |
					 _TAMP_PRIVCFG_BKPWPRIV);
	}

	if (stm32_tamp.pdata.bkpregs_conf) {
		res = stm32_tamp_set_secure_bkpregs();
		if (res)
			goto err;
	}

	stm32_tamp.itr = itr_alloc_add(stm32_tamp.pdata.it,
				       stm32_tamp_it_handler,
				       ITRF_TRIGGER_LEVEL, &stm32_tamp);
	if (!stm32_tamp.itr) {
		res = TEE_ERROR_BAD_PARAMETERS;
		goto err;
	}

	if (stm32_tamp.pdata.is_wakeup_source) {
		struct stm32_tamp_compat *compat = stm32_tamp.pdata.compat;

		if (IS_ENABLED(CFG_STM32_EXTI))
			stm32_exti_enable_wake(stm32_tamp.pdata.exti,
					       compat->exti_wakeup_line);
		else
			IMSG("TAMP event are not configured as wakeup source");
	}

	itr_enable(stm32_tamp.itr->it);

	res = stm32_configure_tamp(fdt, node);
	if (res)
		goto err;

	stm32_tamp_set_pins(base, stm32_tamp.pdata.pins_conf);

	fdt_for_each_subnode(subnode, fdt, node) {
		res = dt_driver_maybe_add_probe_node(fdt, subnode);
		if (res) {
			EMSG("Failed on node %s with %#" PRIx32,
			     fdt_get_name(fdt, subnode, NULL), res);
			panic();
		}
	}

	return TEE_SUCCESS;

err:
	if (stm32_tamp.pdata.compat->tags & TAMP_HAS_RIF_SUPPORT) {
		free(stm32_tamp.pdata.bkpregs_conf->rif_offsets);
		free(stm32_tamp.pdata.conf_data.cid_confs);
		free(stm32_tamp.pdata.conf_data.sec_conf);
		free(stm32_tamp.pdata.conf_data.priv_conf);
		free(stm32_tamp.pdata.conf_data.access_mask);
	}

	free(stm32_tamp.pdata.bkpregs_conf);

	return res;
}

static const struct stm32_tamp_compat mp13_compat = {
		.nb_monotonic_counter = 2,
		.tags = TAMP_HAS_REGISTER_SECCFGR |
			TAMP_HAS_REGISTER_PRIVCFGR |
			TAMP_HAS_REGISTER_ERCFGR |
			TAMP_HAS_REGISTER_CR3 |
			TAMP_HAS_REGISTER_ATCR2 |
			TAMP_HAS_CR2_SECRET_STATUS |
			TAMP_SIZE_ATCR1_ATCKSEL_IS_4,
		.int_tamp = int_tamp_mp13,
		.int_tamp_size = ARRAY_SIZE(int_tamp_mp13),
		.ext_tamp = ext_tamp_mp13,
		.ext_tamp_size = ARRAY_SIZE(ext_tamp_mp13),
		.pin_map = pin_map_mp13,
		.pin_map_size = ARRAY_SIZE(pin_map_mp13),
		.exti_wakeup_line = U(18),
};

static const struct stm32_tamp_compat mp15_compat = {
		.nb_monotonic_counter = 1,
		.tags = 0,
		.int_tamp = int_tamp_mp15,
		.int_tamp_size = ARRAY_SIZE(int_tamp_mp15),
		.ext_tamp = ext_tamp_mp15,
		.ext_tamp_size = ARRAY_SIZE(ext_tamp_mp15),
		.pin_map = pin_map_mp15,
		.pin_map_size = ARRAY_SIZE(pin_map_mp15),
		.exti_wakeup_line = U(18),
};

static const struct stm32_tamp_compat mp25_compat = {
		.nb_monotonic_counter = 2,
		.tags = TAMP_HAS_REGISTER_SECCFGR |
			TAMP_HAS_REGISTER_PRIVCFGR |
			TAMP_HAS_RIF_SUPPORT |
			TAMP_HAS_REGISTER_ERCFGR |
			TAMP_HAS_REGISTER_CR3 |
			TAMP_HAS_REGISTER_ATCR2 |
			TAMP_HAS_CR2_SECRET_STATUS,
		.int_tamp = int_tamp_mp25,
		.int_tamp_size = ARRAY_SIZE(int_tamp_mp25),
		.ext_tamp = ext_tamp_mp25,
		.ext_tamp_size = ARRAY_SIZE(ext_tamp_mp25),
		.pin_map = pin_map_mp25,
		.pin_map_size = ARRAY_SIZE(pin_map_mp25),
		.exti_wakeup_line = U(21),
};

static const struct dt_device_match stm32_tamp_match_table[] = {
	{ .compatible = "st,stm32mp25-tamp", .compat_data = &mp25_compat },
	{ .compatible = "st,stm32mp13-tamp", .compat_data = &mp13_compat },
	{ .compatible = "st,stm32-tamp", .compat_data = &mp15_compat },
	{ }
};

DEFINE_DT_DRIVER(stm32_tamp_dt_driver) = {
	.name = "stm32-tamp",
	.match_table = stm32_tamp_match_table,
	.probe = stm32_tamp_probe,
};
